[
  {
    "id": "1963956641390359037",
    "text": "The only data the market truly embraces as bullish is benign data—not too hot, not too cold. Historically, bull markets sustain themselves during moderate, stable economic periods—what we call a Goldilocks Economy.\n\nStrong data → signals no rate cuts.\nWeak data → revives https://t.co/xWBw2n5BP0",
    "created_at": "2025-09-05T13:25:26+00:00"
  },
  {
    "id": "1965902259759493139",
    "text": "The tragic murder of Charles Kirk has pushed us further down a dangerous path. It’s another example of how division, chaos, and media-fueled outrage are tearing at the fabric of our society.\n\nBut let his death not be in vain. If anything good can come from this, may it be the",
    "created_at": "2025-09-10T22:16:38+00:00"
  },
  {
    "id": "1966129240899768497",
    "text": "Those of you who saw me on IBDLive yesterday morning know I did the show from Virginia International Raceway. Some of you asked to see some video.\nhttps://t.co/5pzt17HjZt",
    "created_at": "2025-09-11T13:18:34+00:00"
  },
  {
    "id": "1966190057624113459",
    "text": "On September 11, 2001, I lived and worked in New York City. I can tell you firsthand—life there changed forever on that day. My deepest condolences to the families, friends, and loved ones who were affected. My heartfelt wish is that a tragedy of that magnitude never strikes our https://t.co/H06R6tPCUT",
    "created_at": "2025-09-11T17:20:14+00:00"
  },
  {
    "id": "1966212132732571859",
    "text": "This 👇 is the culture we’re producing—and these are the people who will inherit the future of our country. We need to stop and think long and hard about what’s happening, what we are becoming, and where we are headed. https://t.co/LG8fVEE1Lg",
    "created_at": "2025-09-11T18:47:57+00:00"
  },
  {
    "id": "1966215920482673038",
    "text": "We are 99 percent commonality, but some of us let the 1% blind us with a lie. That's the power of hate. And the only andedote to hate is love.",
    "created_at": "2025-09-11T19:03:00+00:00"
  },
  {
    "id": "1966216441813737792",
    "text": "I'm pretty sure these kids will look back with regret and will not be proud of this moment.",
    "created_at": "2025-09-11T19:05:04+00:00"
  },
  {
    "id": "1966224721957339217",
    "text": "I actually lost followers because of my posts today about Charles Kirk. Lol! Like they are doing me a favor following me. I guess this is how I weed out the field. 😘",
    "created_at": "2025-09-11T19:37:59+00:00"
  },
  {
    "id": "1966247985043722617",
    "text": "With my good friend tonight having dinner at historic Pine Hurst Country Club on the 18th hole. Beautiful evening. https://t.co/xECHS6DB7g",
    "created_at": "2025-09-11T21:10:25+00:00"
  }
]